{
  "NavBar": {
    "About": "About",
    "Projects": "Projects",
    "Contact": "Contact",
    "Meeting": "Schedule meeting",
    "AllRight": "All rights reserved",
    "DownloadResume": "Download CV"
  },
  "Index": {
    "hello": "Hey, i'm",
    "name": "Gustavo Clemente",
    "description": {
      "header": "Full Stack Web Developer",
      "p1": "Front-End development is my true passion, where I feel completely at ease. This determination and enthusiasm drive the creation of visual and functional solutions that enhance the user experience.",
      "p2": "Always open to new connections and exciting opportunities.",
      "contact": "Contact me here!",
      "modalContact1": "Someone who makes decisions",
      "modalContact2": "and chooses wisely",
      "modalContact3": "controls their destiny."
    },
    "loading": "Loading"
  },
  "Proyects": {
    "title": "Projects",
    "alertTitle": "Wait a moment",
    "alertText": "The following website is not optimized for mobile devices and may not display correctly.",
    "confirmButtonText": "Proceed Anyway",
    "denyButtonText": "View Later",
    "elFestin": {
      "description": "An innovative e-commerce platform designed specifically for a restaurant, meticulously crafted using cutting-edge technologies such as React, Express, and PostgreSQL. The project follows the disciplined framework of the SCRUM methodology to ensure efficient development and delivery."
    },
    "tesloShop": {
      "description": "TesloShop is an e-commerce project that seamlessly integrates the backend within the Next.js application, using Server Actions. Developed 100% with Next.js, TypeScript, Tailwing, Zustand, PostgreSQL, and Prisma, this project offers a dynamic and efficient shopping experience. As a clone of the official Tesla store, not only provides a user-friendly interface but also features a consolidated backend, streamlining processes for secure transactions and robust data management. With PayPal integration, ensures a reliable and hassle-free payment experience for users."
    },
    "henryFood": {
      "description": 
      "Allow me to introduce you to this recipe application that integrates data from an API and enables the creation of custom recipes. This proyect has been developed using cutting-edge technologies such as React, Express, Cloudinary, and PostgreSQL. It is a pivotal component of my individual project at the SoyHenry bootcamp, where I apply and hone my development skills."
    },
    "rickAndMorty": {
      "description": "Check out this Single Page Application (SPA) where I kicked off my journey as a Fullstack developer. It comes with registration and login pages and seamlessly connects to the Rick and Morty API to display character cards, letting users add their favorite characters to their collection."
    },
    "button": "Enter to see the site here",
    "gitHubButton": "View code on GitHub"
  },
  "Contact": {
    "meeting": "Schedule a meeting with me",
    "contact": "Contact me",
    "subtitle": "If you have any questions or concerns, please feel free to contact me.",
    "helpMessage": "I'm here to help!",
    "name": "Name",
    "nameError": "You must enter your name",
    "nameErrorFormat": "Must be a valid name",
    "namePlaceholder": "Enter your name here...",
    "email": "Email",
    "emailError": "You must enter your email",
    "emailErrorFormat": "Must be a valid email",
    "emailPlaceHolder": "Enter your best email...",
    "message":"Message",
    "messageError": "You must write a message",
    "messageErrorFormat": "Must be a valid text",
    "messagePlaceHolder": "Write your query here...",
    "buttonText": "Send",
    "alertTitleSuccess": "Cool!",
    "alertTextSuccess": "Your message has been sent successfully.",
    "alertTitle": "Oops...",
    "alertText": "It seems like something isn't quite right.",
    "loadingText": "Sending..."
  }
}
