{
  "NavBar": {
    "About": "Sobre mí",
    "Projects": "Proyectos",
    "Contact": "Contacto",
    "Meeting": "Agendar reunión",
    "AllRight": "Todos los derechos resrvados",
    "DownloadResume": "Descargar CV"
  },
  "Index": {
    "hello": "Hola, soy",
    "name": "Gustavo Clemente",
    "description": {
      "header": "Desarrollador Web Full Stack",
      "p1": "Actualmente, estoy adquiriendo experiencia en desarrollo Frontend y Backend. Me motiva crear soluciones visuales y funcionales que mejoren la experiencia del usuario, siempre con determinación y entusiasmo.",
      "p2": "Cuando no estoy programando o estudiando, disfruto escuchar podcasts sobre startups. Y cuando necesito desconectar, toco la batería o juego pádel.",
      "contact": "¡Contáctame aquí!",
      "modalContact1": "Quien toma decisiones y",
      "modalContact2": "elije sabiamente,",
      "modalContact3": "controla su destino."
    },
    "loading": "Loading"
  },
  "Proyects": {
    "title": "Proyectos",
    "alertTitle": "Espera un momento",
    "alertText": "EL siguiente sitio no esta optimizado para dispositivos móviles y puede que no se vea correctamente.",
    "confirmButtonText": "Ver de todos modos",
    "denyButtonText": "Ver mas tarde",
    "tesloShop": {
      "description": "TesloShop es un proyecto de comercio electrónico que integra perfectamente el backend dentro de la aplicación Next.js, utilizando Server Actions. Desarrollado 100% con Next.js, TypeScript, Tailwing, Zustand, PostgreSQL y Prisma, este proyecto ofrece una experiencia de compra dinámica y eficiente. Es un clon de la tienda oficial de Tesla, no solo proporciona una interfaz fácil de usar, sino que también cuenta con un backend consolidado, simplificando procesos para transacciones seguras y una gestión robusta de datos. Con la integración de PayPal, garantiza una experiencia de pago confiable y sin complicaciones para los usuarios."
    },
    "elFestin": {
      "description": "Una plataforma de comercio electrónico innovadora diseñada específicamente para un restaurante, meticulosamente elaborada utilizando tecnologías de vanguardia como React, Express y PostgreSQL. El proyecto sigue el disciplinado marco de la metodología SCRUM para garantizar un desarrollo y entrega eficientes."
    },
    "henryFood": {
      "description": "Te presento esta genial aplicación de recetas que incorpora información de una API y permite la creación de recetas personalizadas. Este proyecto ha sido desarrollada utilizando tecnologías como React, Express, Cloudinary y PostgreSQL. Forma parte de mi proyecto individual en el bootcamp de SoyHenry, donde pongo en práctica mis habilidades de desarrollo."
    },
    "rickAndMorty": {
      "description": "Échale un ojo a esta Aplicación de Página Única (SPA) donde comencé mi aventura como desarrollador Fullstack. Incluye páginas de registro e inicio de sesión, y se conecta perfectamente con la API de Rick and Morty para mostrar tarjetas de personajes, permitiendo a los usuarios añadir a sus personajes favoritos a su colección."
    },
    "button": "Ingresa a ver el sitio aquí",
    "gitHubButton": "Ver código en GitHub"
  },
  "Contact": {
    "meeting": "Agenda un cita conmigo",
    "contact": "Contáctame",
    "subtitle": "Si tienes alguna consulta, no dudes en ponerte en contacto conmigo.",
    "helpMessage": "Estoy aquí para ayudarte!",
    "name": "Nombre",
    "nameError": "Debes ingresar tu nombre",
    "nameErrorFormat": "Debe ser un nombre válido",
    "namePlaceholder": "Ingresa tu nombre aquí...",
    "email": "Email",
    "emailError": "Debes ingresar tu email",
    "emailErrorFormat": "Debe ser un email válido",
    "emailPlaceHolder": "Ingresa tu mejor email...",
    "message":"Mensaje",
    "messageError": "Debe escribir un mensaje",
    "messageErrorFormat": "Debe ser un texto válido",
    "messagePlaceHolder": "Escribe tu consulta aquí...",
    "buttonText": "Enviar",
    "alertTitleSuccess": "¡Genial!",
    "alertTextSuccess": "Tu mensaje fué enviado correctamente.",
    "alertTitle": "Uups...",
    "alertText": "Parece que algo no anda bien",
    "loadingText": "Enviando..."
  }
}


